x = int(input())
n = ''

#ДЕСЯТКИ до СТА
if x < 100 and x >= 90:
    n += 'X'
#СТО
if x <= 100 and x >= 90:
    n += 'C'
#ДЕСЯТКИ до 50
if x >= 40 and x <= 49:
    n += 'X'
#50
if x>=40 and x<90:
    n += 'L'
#ДЕСЯТКИ после 50
if (x-50)//10 < 4:
    n += 'X'*((x-50)//10)
#ДЕСЯТКИ
if x//10 < 4:
    n += 'X'*(x//10)
#ЕДИНИЦЫ до V
if x%10 == 4:
    n += 'I'
#ПЯТЁРКИ
if x%10 >= 4 and x%10 <= 8:
    n += 'V'
#ЕДИНИЦЫ без V
if x%10 < 4:
    n += 'I'*(x%10)
#ЕДИНИЦЫ после V
if (x-5)%10 < 4:
    n += 'I'*((x-5)%10)
#ДЕВЯТКИ
if x%10 == 9:
    n += 'IX'

print(n)